goal-app/app/views/users/index.html.erb

<% @users.each do |user| %>
  <a href="https://naruto.fandom.com/wiki/<%= user.username.split(' ').join('_') %>">
---
SELECT "users".* FROM "users"